app/controllers/authentications_controller.rb

  def register
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "firstname", "lastname", "created_at", "updated_at", "email", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def login
    user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "claire@claire.com"], ["LIMIT", 1]]