app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "gilfoyle"], ["created_at", "2017-07-24 15:29:36.092687"], ["updated_at", "2017-07-24 15:29:36.092687"]]
---
  def create
    @user = User.new(user_params)

    if @user.save